import { TrainerType } from "./enums/trainer-type";
import * as Utils from "../utils";

class TrainerNameConfig {
  public urls: string[];
  public femaleUrls: string[];

  constructor(type: TrainerType, ...urls: string[]) {
    this.urls = urls.length ? urls : [ Utils.toReadableString(TrainerType[type]).replace(/ /g, '_') ];
  }

  hasGenderVariant(...femaleUrls: string[]): TrainerNameConfig {
    this.femaleUrls = femaleUrls.length ? femaleUrls : null;
    return this;
  }
}

interface TrainerNameConfigs {
  [key: integer]: TrainerNameConfig
}

const trainerNameConfigs: TrainerNameConfigs = {
  [TrainerType.ACE_TRAINER]: new TrainerNameConfig(TrainerType.ACE_TRAINER),
  [TrainerType.ARTIST]: new TrainerNameConfig(TrainerType.ARTIST),
  [TrainerType.BACKERS]: new TrainerNameConfig(TrainerType.BACKERS),
  [TrainerType.BACKPACKER]: new TrainerNameConfig(TrainerType.BACKPACKER),
  [TrainerType.BAKER]: new TrainerNameConfig(TrainerType.BAKER),
  [TrainerType.BEAUTY]: new TrainerNameConfig(TrainerType.BEAUTY),
  [TrainerType.BIKER]: new TrainerNameConfig(TrainerType.BIKER),
  [TrainerType.BLACK_BELT]: new TrainerNameConfig(TrainerType.BLACK_BELT).hasGenderVariant('战斗少女'),
  [TrainerType.BREEDER]: new TrainerNameConfig(TrainerType.BREEDER, '宝可梦培育家'),
  [TrainerType.CLERK]: new TrainerNameConfig(TrainerType.CLERK),
  [TrainerType.CYCLIST]: new TrainerNameConfig(TrainerType.CYCLIST),
  [TrainerType.DANCER]: new TrainerNameConfig(TrainerType.DANCER),
  [TrainerType.DEPOT_AGENT]: new TrainerNameConfig(TrainerType.DEPOT_AGENT),
  [TrainerType.DOCTOR]: new TrainerNameConfig(TrainerType.DOCTOR).hasGenderVariant('护士'),
  [TrainerType.FISHERMAN]: new TrainerNameConfig(TrainerType.FISHERMAN),
  [TrainerType.GUITARIST]: new TrainerNameConfig(TrainerType.GUITARIST),
  [TrainerType.HARLEQUIN]: new TrainerNameConfig(TrainerType.HARLEQUIN),
  [TrainerType.HIKER]: new TrainerNameConfig(TrainerType.HIKER),
  [TrainerType.HOOLIGANS]: new TrainerNameConfig(TrainerType.HOOLIGANS),
  [TrainerType.HOOPSTER]: new TrainerNameConfig(TrainerType.HOOPSTER),
  [TrainerType.INFIELDER]: new TrainerNameConfig(TrainerType.INFIELDER),
  [TrainerType.JANITOR]: new TrainerNameConfig(TrainerType.JANITOR),
  [TrainerType.LINEBACKER]: new TrainerNameConfig(TrainerType.LINEBACKER),
  [TrainerType.MAID]: new TrainerNameConfig(TrainerType.MAID),
  [TrainerType.MUSICIAN]: new TrainerNameConfig(TrainerType.MUSICIAN),
  [TrainerType.HEX_MANIAC]: new TrainerNameConfig(TrainerType.HEX_MANIAC),
  [TrainerType.NURSERY_AIDE]: new TrainerNameConfig(TrainerType.NURSERY_AIDE),
  [TrainerType.OFFICER]: new TrainerNameConfig(TrainerType.OFFICER),
  [TrainerType.PARASOL_LADY]: new TrainerNameConfig(TrainerType.PARASOL_LADY),
  [TrainerType.PILOT]: new TrainerNameConfig(TrainerType.PILOT),
  [TrainerType.POKEFAN]: new TrainerNameConfig(TrainerType.POKEFAN, '宝可梦迷'),
  [TrainerType.PRESCHOOLER]: new TrainerNameConfig(TrainerType.PRESCHOOLER),
  [TrainerType.PSYCHIC]: new TrainerNameConfig(TrainerType.PSYCHIC),
  [TrainerType.RANGER]: new TrainerNameConfig(TrainerType.RANGER),
  [TrainerType.RICH]: new TrainerNameConfig(TrainerType.RICH, '绅士').hasGenderVariant('夫人'),
  [TrainerType.RICH_KID]: new TrainerNameConfig(TrainerType.RICH_KID, '富家少爷').hasGenderVariant('女士'),
  [TrainerType.ROUGHNECK]: new TrainerNameConfig(TrainerType.ROUGHNECK),
  [TrainerType.SCIENTIST]: new TrainerNameConfig(TrainerType.SCIENTIST),
  [TrainerType.SMASHER]: new TrainerNameConfig(TrainerType.SMASHER),
  [TrainerType.SNOW_WORKER]: new TrainerNameConfig(TrainerType.SNOW_WORKER, '工人'),
  [TrainerType.STRIKER]: new TrainerNameConfig(TrainerType.STRIKER),
  [TrainerType.STUDENT]: new TrainerNameConfig(TrainerType.STUDENT, '小学生'),
  [TrainerType.SWIMMER]: new TrainerNameConfig(TrainerType.SWIMMER),
  [TrainerType.TWINS]: new TrainerNameConfig(TrainerType.TWINS),
  [TrainerType.VETERAN]: new TrainerNameConfig(TrainerType.VETERAN),
  [TrainerType.WAITER]: new TrainerNameConfig(TrainerType.WAITER).hasGenderVariant('女服务员'),
  [TrainerType.WORKER]: new TrainerNameConfig(TrainerType.WORKER),
  [TrainerType.YOUNGSTER]: new TrainerNameConfig(TrainerType.YOUNGSTER).hasGenderVariant('少女')
};

export const trainerNamePools = {
	[TrainerType.ACE_TRAINER]: [["亚伦","艾伦","布莱克","布莱恩","加文","杰克","凯文","迈克","尼克","保罗","瑞安","肖恩","达林","艾伯特","伯克","克莱德","埃德加","乔治","勒罗伊","欧文","帕克","兰德尔","鲁本","塞缪尔","文森特","沃伦","威尔顿","赞恩","阿尔弗雷德","布拉克斯顿","费利克斯","杰拉尔德","乔纳森","莱昂内尔","马塞尔","米切尔","昆西","罗德里克","科尔比","罗兰多","裕二","亚伯","安东","亚瑟","凯撒","道尔顿","丹尼斯","欧内斯特","加勒特","格雷厄姆","亨利","以赛亚","约拿","何塞","基南","弥迦","奥马尔","奎因","罗多尔福","扫罗","塞尔吉奥","斯凯拉","斯特凡","扎切里","奥尔顿","阿拉贝拉","博尼塔","卡尔","科迪","弗兰奇","科比","保罗","谢伊","奥斯汀","贝克特","查理","科基","大卫","德维恩","埃尔默","杰西","贾里德","约翰","乔丹","基普","卢","特里","汤姆","韦伯斯特","比利","道尔","恩佐","杰夫","格兰特","凯尔西","米格尔","皮尔斯","雷","桑蒂诺","谢尔","阿德尔伯特","本斯","埃米尔","埃万","马蒂斯","马克西姆","尼尔","里科","罗比","西奥","维克多","本尼迪克特","科尼利厄斯","久人","利奥波德","内维尔","维托","蔡斯","科尔","浩史","杰克逊","吉姆","凯科阿","马卡纳","悠希","埃尔伍德","赛斯","阿尔文","阿尔琼","阿诺德","卡梅隆","卡尔","卡尔顿","克里斯托弗","戴夫","达克斯","多米尼克","埃德蒙","芬恩","弗雷德","加勒特","格雷森","杰斯","贾克斯","杰伊","吉拉德","约翰逊","凯登","凯特","路易斯","麦克","马蒂","珀西","雷蒙德","罗尼","萨奇","蒂姆","扎克","康纳","文斯","贝德罗","博达","博坦","达拉斯","杜里","赫顿","雷文","斯图姆","托克","特里洛","贝尔基","克鲁伊克","达松","德西德","迪洛特","法芬","福贡","赫贝尔","莫方","莫里尔","沙德","范胡布","巴尔多","卡本","德金","戈普斯","克莱普特","拉斯克","马莱克斯","莫帕","奈尔德","诺克松","特斯拉","泰蒂尔"],["贝丝","卡罗尔","西比尔","艾玛","弗兰","格温","艾琳","珍","乔伊斯","凯特","凯利","露易丝","洛拉","梅根","奎因","瑞娜","卡拉","亚历克莎","布鲁克","卡罗琳","伊莲","霍普","詹妮弗","乔迪","朱莉","洛瑞","玛丽","米歇尔","香农","温迪","亚历克西娅","艾丽西亚","雅典娜","卡罗莱纳","克里斯汀","达西","黛安","哈莉","贾兹敏","凯特琳","凯拉","马利","艾莉森","凯瑟琳","娜奥米","艾丽莎","阿丽亚娜","布兰迪","布雷安娜","布伦达","布伦娜","凯瑟琳","克拉丽斯","达娜","迪安娜","命运","杰米","茉莉","卡桑德拉","劳拉","玛丽亚","玛丽亚","玛雅","梅根","米凯拉","莫妮克","娜塔莎","奥利维亚","桑德拉","萨凡纳","悉尼","莫伊拉","派珀","萨尔玛","艾莉森","贝弗利","凯西","夏安","克拉拉","达拉","艾琳","格林达","淳子","莉娜","露西尔","玛丽安娜","奥尔文","尚塔","斯特拉","安吉","贝尔","钱德拉","科拉","夏娃","杰奎琳","珍妮","朱丽叶","凯瑟琳","莱拉","卢卡","梅丽娜","米基","尼娜","黑貂","雪莉","夏天","特里什","维基","阿兰扎","科迪莉亚","希尔德","艾米尔达","米歇尔","米雷耶","克劳迪娅","康斯坦斯","哈丽雅特","荣誉","梅尔巴","波西娅","亚历克西斯","安吉拉","卡拉","林赛","托里","谢里","贾达","凯莉","阿曼达","安妮","金德拉","凯拉","索菲亚","伊薇特","贝基","弗洛拉","格洛丽亚","布纳","费尔达","莱汉","利基","洛门","内拉","阿蒂洛","德塔","吉莉","戈斯尼","莱文斯","摩登","拉斯克","拉泰斯","罗斯诺","泰南","维罗妮卡","佐伊尔","西达","迪布辛","多丁","埃布森","埃奎因","弗洛斯汀","加布森","哈尔森","希尔昂","奎洛","拉佩尔","罗泽","坦辛"]],
	[TrainerType.ARTIST]: [["伊斯梅尔","威廉","霍顿","皮埃尔","扎克","高夫","萨尔瓦多","文森特","邓肯"],["乔治娅"]],
	[TrainerType.BACKERS]: [["阿尔夫和弗雷德","霍克和达尔","乔和罗斯","莱斯和韦伯","马萨和亚斯","斯图和阿特"],["艾和西埃尔","阿米和艾拉","卡姆和艾比","菲和苏","凯特和菲","凯和阿里","艾娃和阿亚","克莱奥和里约","梅和玛"]],
	[TrainerType.BACKPACKER]: [["亚历山大","卡洛斯","赫尔曼","杰罗姆","基恩","凯尔西","清","迈克尔","内特","彼得","山姆","斯蒂芬","塔伦","特伦斯","彻","韦伦","布恩","克利福德","伊万","肯德尔","洛厄尔","兰德尔","里斯","罗兰","谢恩","沃尔特","法里德","海克","乔伦","莱恩","罗德里克","达内尔","迪恩","埃默里","格雷姆","格雷森","阿什利","美子","奇安娜","珀迪","玛丽亚","裕和","佩伦","芭芭拉","黛安","露丝","艾托尔","亚历克斯","阿图罗","阿西尔","海梅","乔纳森","胡里奥","凯文","康介","兰德尔","马尔科","马特奥","尼尔","保罗","塞缪尔"],["安娜","科林","伊莱恩","艾米","吉尔","久美子","莉兹","露易丝","洛拉","莫莉","帕蒂","露丝","维基","安妮","布鲁森","克拉拉","艾琳","梅","迈拉","瑞秋","塔米"]],
	[TrainerType.BAKER]: ["克里斯","珍","莉莉"],
	[TrainerType.BEAUTY]: ["卡西","茱莉娅","奥利维亚","萨曼莎","瓦莱丽","维多利亚","布丽奇特","康妮","杰西卡","乔安娜","梅丽莎","希拉","雪莉","蒂芙尼","美子","塔利亚","格蕾丝","萝拉","洛瑞","毛拉","塔米娅","辛迪","德文","加布里埃拉","哈雷","林赛","尼古拉","凯莉","夏洛特","卡桑德拉","十二月","弗莱明","尼古拉","艾米","阿奈斯","布里吉特","卡桑德拉","安德烈娅","布列塔尼","卡罗琳","克里斯托","亚历克西斯","爱丽丝","艾娜","安雅","阿里安娜","奥布里","贝弗利","卡米尔","美女","艾薇特","汉索尔","春香","吉尔","乔","拉娜","露易丝","露西","梅","尼基","妮可","普里塔","罗斯","雪莉","苏西","泰莎","安妮塔","艾丽莎","丽塔","库西","埃洛夫","米鲁","米诺","内瓦","尼文","奥戈因"],
	[TrainerType.BIKER]: ["查尔斯", "德维恩", "格伦", "哈里斯", "乔尔", "莱利", "齐克", "亚历克斯", "比利", "欧内斯特", "杰拉尔德", "希迪奥", "艾萨克", "贾里德", "贾伦", "杰克逊", "乔迪", "老", "卢卡斯", "马利克", "尼古拉斯", "里卡多", "鲁本", "维吉尔", "威廉", "艾登", "戴尔", "丹", "雅各布", "马基", "里斯", "泰迪", "塞隆", "杰里米", "摩根", "菲利普", "菲利普", "斯坦利", "狄龙"],
	[TrainerType.BLACK_BELT]: [["健二", "老", "龙", "诺布", "怀", "义", "笃", "大辅", "英树", "仁", "清", "浩一", "浩二", "雄二", "克里斯蒂安", "瑞德", "隆夫", "西奥多", "赞德", "亚伦", "休", "迈克", "尼古拉斯", "谢伊", "隆", "亚当", "卡尔", "科尔比", "达伦", "大卫", "达文", "德里克", "埃迪", "格雷戈里", "格里芬", "贾勒特", "杰弗里", "肯德尔", "凯尔", "卢克", "迈尔斯", "纳撒尼尔", "菲利普", "拉斐尔", "雷", "瑞奇", "肖恩", "威利", "安德", "曼福德", "本杰明", "科里", "爱德华", "格兰特", "杰伊", "肯德鲁", "健太郎", "莱德", "铁平", "托马斯", "泰隆", "安德烈", "唐尼", "德拉戈", "戈登", "格里戈", "杰瑞尔", "肯尼斯", "马特尔", "马蒂斯", "里奇", "洛基", "罗德里戈", "韦斯利", "扎切里", "阿隆索", "卡多克", "冈纳", "伊戈尔", "基利安", "马库斯", "里卡多", "亚尼斯", "班廷", "克莱顿", "杜安", "厄尔", "格雷格", "罗伊", "特里", "特蕾西", "沃尔特", "阿尔瓦罗", "柯蒂斯", "弗朗西斯", "罗斯", "布莱斯", "程", "达德利", "埃里克", "卡诺", "雅浩", "兰迪", "龙二", "史蒂夫", "忠", "王", "元", "布莱恩", "卡特", "里斯", "尼克", "杨"], ["科拉", "辛迪", "吉尔", "劳拉", "萨迪", "泰莎", "薇薇安", "艾莎", "凯莉", "丹妮尔", "海伦", "乔斯林", "莉莉丝", "宝拉", "雷娜", "海伦", "凯尔西", "泰勒", "艾米", "钱德拉", "希拉里", "珍妮", "李", "麦琪", "美子", "米里亚姆", "莎伦", "苏西", "小", "艾丽兹", "阿兹拉", "布伦达", "查丽娜", "陈", "格林达", "真希", "蒂亚", "蒂芙尼", "温迪", "安德烈娅", "加布里埃尔", "杰拉尔丁", "海莉", "赫德维格", "贾斯汀", "金赛", "西格丽德", "维罗尼克", "泰丝"]],
	[TrainerType.BREEDER]: [["艾萨克", "迈尔斯", "萨尔瓦多", "艾伯特", "卡利尔", "尤斯塔斯", "盖伦", "欧文", "艾迪生", "马库斯", "福斯特", "科里", "格伦", "杰伊", "韦斯利", "威廉", "艾德里安", "布拉德利", "海梅"], ["艾莉森", "艾丽兹", "贝瑟尼", "莉莉", "莉迪亚", "加布里埃尔", "杰登", "帕特", "维罗妮卡", "琥珀", "詹妮弗", "凯莉", "阿德莱德", "布鲁克", "埃塞尔", "四月", "艾琳", "木兰", "阿玛拉", "梅西", "阿曼达", "伊库", "萨凡纳", "尤卡", "克洛伊", "黛布拉", "丹尼斯", "埃琳娜"]],
	[TrainerType.CLERK]: [["查兹", "克莱门斯", "道格", "弗雷德里克", "伊万", "艾萨克", "尼尔森", "韦德", "沃伦", "奥古斯丁", "吉利根", "科迪", "杰里米", "肖恩", "杜加尔", "罗伊斯", "罗纳德"], ["艾伯塔", "英格丽", "凯蒂", "派珀", "特丽莎", "雷恩", "布兰妮", "拉娜", "杰西卡", "克里斯汀", "米歇尔", "加布里埃尔"]],
	[TrainerType.CYCLIST]: [["阿克塞尔", "詹姆斯", "约翰", "瑞安", "赫克托", "耶利米"], ["凯拉", "梅根", "妮可", "瑞秋", "克丽莎", "阿德莱德"]],
	[TrainerType.DANCER]: ["布莱恩", "戴维", "德克", "埃德蒙", "米奇", "雷蒙德", "卡拉", "茱莉娅", "迈卡", "米雷耶", "隆达", "佐伊"],
	[TrainerType.DEPOT_AGENT]: ["乔希", "汉克", "文森特"],
	[TrainerType.DOCTOR]: [["汉克", "杰瑞", "朱尔斯", "洛根", "韦恩", "布雷德", "德里克", "希思", "朱利叶斯", "基特", "格雷厄姆"], ["克尔斯滕", "幸子", "雪莉", "卡罗尔", "迪克西", "玛丽亚"]],
	[TrainerType.FISHERMAN]: ["安德烈", "阿诺德", "巴尼", "克里斯", "埃德加", "亨利", "约拿", "贾斯汀", "凯尔", "马丁", "马文", "拉尔夫", "雷蒙德", "斯科特", "斯蒂芬", "威尔顿", "塔利", "安德鲁", "巴尼", "卡特", "克劳德", "戴尔", "艾略特", "尤金", "伊万", "内德", "诺兰", "罗杰", "罗纳德", "韦德", "韦恩", "达里安", "凯", "奇普", "汉克", "凯登", "汤米", "泰勒", "亚历克", "布雷特", "卡梅伦", "科迪", "科尔", "科里", "埃里克", "乔治", "约瑟夫", "胡安", "肯尼斯", "卢克", "米格尔", "特拉维斯", "沃尔特", "扎卡里", "乔希", "基甸", "凯勒", "利亚姆", "墨菲", "布鲁斯", "达蒙", "德文", "休伯特", "琼斯", "莱顿", "米克", "皮特", "肖恩", "锡德", "文斯", "巴基", "迪恩", "尤斯塔斯", "肯佐", "勒罗伊", "麦克", "莱德", "埃文", "芬恩", "默里", "苏厄德", "沙德", "沃顿", "芬利", "费舍尔", "菲斯克", "里弗", "谢弗", "蒂明", "卡尔", "欧内斯特", "哈尔", "赫伯特", "久人", "迈克", "弗农", "哈丽特", "玛丽娜", "蔡斯"],
	[TrainerType.GUITARIST]: ["安娜", "贝弗利", "一月", "蒂娜", "艾丽西亚", "克劳迪娅", "茱莉娅", "莉迪亚", "米雷娅", "诺埃利亚", "莎拉", "希拉", "塔蒂亚娜"],
	[TrainerType.HARLEQUIN]: ["查理", "伊恩", "杰克", "凯瑞", "路易斯", "帕特", "保罗", "里克", "安德斯", "克拉伦斯", "加里"],
	[TrainerType.HIKER]: ["安东尼", "贝利", "本杰明", "丹尼尔", "埃里克", "吉姆", "肯尼", "伦纳德", "迈克尔", "帕里", "菲利普", "罗素", "西德尼", "蒂姆", "蒂莫西", "艾伦", "布莱斯", "克拉克", "埃里克", "莱尼", "卢卡斯", "迈克", "特伦特", "德文", "伊莱", "马克", "索耶", "艾伦", "达里尔", "达德利", "厄尔", "富兰克林", "杰里米", "马科斯", "诺布", "奥利弗", "韦恩", "亚历山大", "达蒙", "乔纳森", "贾斯汀", "凯文", "洛伦佐", "路易斯", "莫里斯", "尼古拉斯", "雷金纳德", "罗伯特", "西奥多", "布鲁斯", "克拉克", "德文", "德怀特", "埃德温", "欧因", "诺兰", "罗素", "安迪", "布雷特", "达雷尔", "吉恩", "哈代", "休", "杰贝迪亚", "耶利米", "基特", "尼尔", "特雷尔", "唐", "道格", "亨特", "贾里德", "杰罗姆", "基思", "曼努埃尔", "马库斯", "奥托", "谢尔比", "斯蒂芬", "铁平", "托拜厄斯", "韦德", "扎伊姆", "亚伦", "阿兰", "伯金", "伯纳德", "布伦特", "科温", "克雷格", "德尔蒙", "邓斯坦", "奥雷斯特斯", "罗斯", "戴维安", "卡尔霍恩", "大卫", "加布里埃尔", "瑞安", "托马斯", "特拉维斯", "扎卡里", "阿努希亚", "巴纳比", "克劳斯", "科林", "科尔森", "德克斯特", "迪伦", "尤金", "法卡斯", "久人", "朱利叶斯", "健二", "欧文", "莱昂内尔", "保罗", "里希特", "瓦伦蒂诺", "唐纳德", "道格拉斯", "凯文", "安吉拉", "卡拉", "西莉亚", "丹妮拉", "埃斯特拉", "法蒂玛", "海伦娜", "莱尔", "露西亚", "露娜", "曼努埃拉", "马尔", "玛丽娜", "美雪", "南希", "妮瑞亚", "宝拉", "罗西奥", "亚妮拉", "切斯特"],
	[TrainerType.HOOLIGANS]: ["吉姆和凯斯", "罗布和萨尔"],
	[TrainerType.HOOPSTER]: ["鲍比", "约翰", "拉马库斯", "德里克", "尼古拉斯"],
	[TrainerType.INFIELDER]: ["亚历克斯", "康纳", "托德"],
	[TrainerType.JANITOR]: ["查理","伊恩","杰克","凯瑞","路易斯","派特","保罗","里克","安德斯","克拉伦斯","加里"],
	[TrainerType.LINEBACKER]: ["鲍勃","丹","约拿"],
	[TrainerType.MAID]: ["贝琳达","索菲","艾米丽","埃琳娜","克莱尔","艾丽卡","坦尼娅","塔米"],
	[TrainerType.MUSICIAN]: ["鲍里斯", "普雷斯顿", "查尔斯", "克莱德", "文森特", "道尔顿", "柯克", "肖恩", "费边", "费尔南多", "约瑟夫", "马科斯", "阿图罗", "杰瑞", "朗尼", "托尼"],
	[TrainerType.NURSERY_AIDE]: ["奥特姆", "布里安娜", "莉亚", "米霍", "埃塞尔", "霍莉", "伊尔丝", "琼", "基米亚", "罗莎琳"],
	[TrainerType.OFFICER]: ["德克", "基思", "亚历克斯", "鲍比", "迦勒", "丹尼", "迪伦", "托马斯", "丹尼尔", "杰夫", "布雷文", "戴尔", "尼格尔", "春树", "米切尔", "雷蒙德"],
	[TrainerType.PARASOL_LADY]: ["安吉莉卡", "克莱丽莎", "玛德琳", "朱莉", "安娜贝尔", "凯莉", "瑞秋", "亚莉克莎", "莎宾娜", "艾普莉", "格温妮丝", "劳拉", "露米", "玛丽亚", "梅丽塔", "妮可", "缇安娜", "英格丽", "泰拉"],
	[TrainerType.PILOT]: ["蔡斯", "伦纳德", "泰德", "埃尔隆", "尤因", "弗林", "温斯洛"],
	[TrainerType.POKEFAN]: [["亚历克斯", "艾伦", "布兰登", "卡特", "科林", "德里克", "杰里米", "约书亚", "雷克斯", "罗伯特", "特雷弗", "威廉", "科尔顿", "米格尔", "弗朗西斯科", "凯勒布", "伦纳德", "布恩", "埃利奥特", "裘德", "诺伯特", "科里", "加布", "巴克斯特"], ["贝弗利", "乔治娅", "杰米", "露丝", "伊莎贝尔", "玛丽莎", "瓦妮莎", "安妮卡", "贝瑟尼", "金伯利", "梅雷迪思", "丽贝卡", "埃莉诺", "达西", "莉迪亚", "幸子", "阿比盖尔", "艾格尼丝", "莉迪", "罗伊辛", "塔拉", "卡门", "珍妮特"]],
	[TrainerType.PRESCHOOLER]: [["比利", "道尔", "埃文", "霍默", "塔利", "艾伯特", "巴斯特", "格雷格", "艾克", "乔乔", "泰隆", "艾德里安", "奥利弗", "海登", "亨特", "凯勒布", "利亚姆", "迪伦"], ["朱丽叶", "米娅", "莎拉", "温迪", "温特", "克里斯", "伊娃", "琳", "萨曼莎", "艾拉", "莉莉", "娜塔莉", "艾莉", "汉娜", "玛丽亚", "金德拉", "南希"]],
	[TrainerType.PSYCHIC]: [["菲德尔", "富兰克林", "吉尔伯特", "格雷格", "赫尔曼", "贾里德", "马克", "内森", "诺曼", "菲尔", "理查德", "罗德尼", "卡梅伦", "爱德华", "弗里茨", "约书亚", "普雷斯顿", "维吉尔", "威廉", "阿尔瓦罗", "布莱克", "塞德里克", "基南", "尼古拉斯", "达里奥", "约翰", "洛伦佐", "泰隆", "布莱斯", "科尔宾", "迪安德烈", "伊莱贾", "科迪", "兰登", "麦克斯韦尔", "米切尔", "斯特林", "伊莱", "尼尔森", "弗农", "加文", "杰拉德", "洛", "米奇", "佩里", "鲁道夫", "汤米", "艾尔", "南多", "塔利", "亚瑟", "伊曼纽尔", "弗朗茨", "哈利", "帕斯卡", "罗伯特", "赛义德", "安吉洛", "安东", "艾琳", "艾弗里", "丹尼", "弗雷泽", "哈里森", "海梅", "罗斯", "瑞", "弗拉德", "梅森"], ["亚历克西斯", "汉娜", "杰基", "杰克琳", "凯拉", "莫拉", "萨曼莎", "艾丽克斯", "布兰迪", "埃迪", "梅西", "玛丽埃拉", "玛琳", "劳拉", "罗黛特", "阿比盖尔", "布列塔尼", "切尔西", "黛西", "德西蕾", "肯德拉", "林赛", "雷切尔", "瓦伦西亚", "贝尔", "西比尔", "多琳", "杜阿", "未来", "琳", "马杜", "艾丽娅", "恩娜", "乔伊斯", "莱内特", "奥莱西亚", "莎拉"]],
	[TrainerType.RANGER]: [["卡洛斯", "杰克逊", "塞巴斯蒂安", "加夫", "洛伦佐", "洛根", "尼古拉斯", "特伦顿", "德肖恩", "德维恩", "杰弗里", "凯勒", "泰勒", "阿兰", "克劳德", "克罗夫顿", "福雷斯特", "哈利", "杰登", "基思", "刘易斯", "米格尔", "佩德罗", "拉尔夫", "理查德", "布雷特", "达里尔", "埃迪", "约翰", "利夫", "路易斯", "麦克斯韦尔", "帕克", "里克", "史蒂夫", "比约恩", "蔡斯", "迪安", "李", "莫里斯", "纳什", "拉尔夫", "里德", "忍", "塞拉斯"], ["凯瑟琳", "珍娜", "索菲亚", "梅雷迪思", "诺拉", "贝丝", "切尔西", "凯特琳", "玛德琳", "艾莉森", "阿什莉", "费利西亚", "克里斯塔", "安妮", "奥德拉", "布伦达", "克洛里斯", "伊丽莎", "海蒂", "艾琳", "玛丽", "米琳", "尚蒂", "雪莉", "塔利亚", "安雅", "布里安娜", "黛安娜", "伊莱恩", "艾丽", "希拉里", "凯蒂", "莉娜", "洛伊斯", "马洛里", "梅丽塔", "美子", "直子", "宁静", "安布雷", "布鲁克", "克莱门汀", "梅丽娜", "佩特拉", "特维吉"]],
	[TrainerType.RICH]: [["阿尔弗雷德", "爱德华", "格雷戈里", "普雷斯顿", "托马斯", "塔克", "沃尔特", "克利福德", "埃弗雷特", "米卡", "内特", "皮埃尔", "特伦斯", "亚瑟", "布鲁克斯", "伊曼纽尔", "拉马尔", "杰里米", "莱昂纳多", "弥尔顿", "弗雷德里克", "雷诺", "罗伯特", "严", "丹尼尔", "谢尔顿", "斯通沃尔", "杰拉德", "罗纳德", "史密斯", "斯坦利", "雷金纳德", "奥森", "威尔科", "凯登", "格伦"], ["丽贝卡", "蕾娜", "卡桑德拉", "艾米莉亚", "格蕾丝", "玛丽安", "伊丽莎白", "凯瑟琳", "小百合", "卡罗琳", "朱迪"]],
	[TrainerType.RICH_KID]: [["加勒特", "温斯顿", "道森", "恩里克", "杰森", "罗曼", "特雷", "利亚姆", "安东尼", "布拉德", "科迪", "曼努埃尔", "马丁", "皮尔斯", "罗兰", "基南", "菲尔伯特", "安托万", "赛勒斯", "迪克", "杜戈", "弗里茨", "尤雷克", "隆德", "珀德", "昆特", "巴斯托", "贝尼特", "布罗特", "登克", "盖伊特", "马康", "珀克", "普罗斯", "罗埃克斯", "塞恩斯", "西明", "塔克", "维纳克"], ["安妮特", "布里安娜", "辛迪", "科琳", "达芙妮", "伊丽莎白", "娜奥米", "莎拉", "夏洛特", "吉莉安", "杰基", "蕾迪", "梅丽莎", "塞莱斯特", "科莱特", "伊丽赞德拉", "伊莎贝尔", "琳内特", "木兰", "索菲", "莉娜", "杜尔西", "奥罗", "布林", "卡丽尔", "埃洛斯", "格温", "艾拉", "考利", "瑞玛", "里斯廷", "维西", "布雷娜", "迪西", "登斯隆", "凯莉特", "妮米", "蕾妮", "萨诺", "斯托纳", "斯特克", "塔尔曼", "佐伊拉"]],
	[TrainerType.ROUGHNECK]: ["卡梅隆", "科里", "加布里埃尔", "以赛亚", "贾马尔", "浩二", "卢克", "帕克斯顿", "劳尔", "齐克", "柯比", "钱斯", "戴夫", "弗莱彻", "约翰尼", "里斯", "乔伊", "瑞奇", "西尔维斯特", "马丁"],
	[TrainerType.SCIENTIST]: [["杰德", "马克", "米奇", "里奇", "罗斯", "博", "布雷登", "康纳", "艾德", "伊万", "杰瑞", "何塞", "约书亚", "帕克", "罗德尼", "泰勒", "泰德", "特拉维斯", "扎克里", "达里乌斯", "埃米利奥", "弗雷德里克", "肖恩", "斯特凡诺", "特拉文", "丹尼尔", "加勒特", "格雷格", "林登", "洛厄尔", "特伦顿", "达德利", "卢克", "马库斯", "内森", "奥维尔", "兰德尔", "罗恩", "罗纳德", "西蒙", "史蒂夫", "威廉", "富兰克林", "克拉克", "雅克", "特伦斯", "恩斯特", "尤斯图斯", "伊凯卡", "杰森", "凯尔", "里德", "泰隆", "亚当", "艾伯特", "阿方斯", "科里", "唐尼", "埃尔顿", "弗朗西斯", "戈登", "赫伯特", "汉弗莱", "乔丹", "朱利安", "基顿", "利瓦伊", "梅尔文", "默里", "韦斯特", "克雷格", "科伦", "杜比克", "科坦", "莱思科", "曼特", "莫特", "米隆", "奥德洛", "里贝克", "罗克", "沃吉", "冯德", "佐戈", "多伊莫", "多顿", "杜雷尔", "希尔顿", "库克拉", "梅萨", "纳诺特", "普拉滕", "拉伯恩", "雷曼", "阿克罗德", "科菲", "埃尔罗克", "福斯", "哈迪格", "洪堡", "霍斯佩尔", "卡勒", "克洛茨", "克里洛克", "利马", "洛基特", "梅萨克", "莫比特", "纽因", "奥里尔", "塔博尔", "特科特"], ["布莱斯", "陈", "凯瑟琳", "玛丽", "玛丽亚", "直子", "萨曼莎", "里美", "香农", "雅典娜", "卡罗琳", "卢米", "卢米娜", "玛丽莎", "索尼娅"]],
	[TrainerType.SMASHER]: ["阿斯彭", "埃琳娜", "玛丽", "艾米", "莉齐"],
	[TrainerType.SNOW_WORKER]: [["布雷登", "布伦登", "科林", "康拉德", "迪伦", "加里", "杰拉多", "霍尔顿", "杰克逊", "梅森", "昆汀", "威利", "诺埃尔", "阿诺德", "布雷迪", "布兰德", "凯恩", "克里夫", "唐", "埃迪", "费利克斯", "菲利普", "格伦", "格斯", "希思", "马修", "巴顿", "里奇", "罗布", "瑞安", "斯科特", "谢尔比", "斯特林", "泰勒", "维克多", "扎克", "弗里德里希", "赫尔曼", "艾萨克", "利奥", "梅纳德", "米切尔", "摩根", "内森", "尼尔", "帕斯夸尔", "保罗", "塔瓦里乌斯", "蒂博尔", "迪米特里", "纳雷克", "尤瑟夫", "弗兰克", "杰夫", "瓦茨拉夫", "奥维德", "弗朗西斯", "基思", "罗素", "桑贡", "托维", "轰炸机", "奇恩", "德米特", "胡博", "凯比勒", "拉博", "奥多", "雷泰", "罗尼克斯", "瓦格尔", "多比特", "卡斯特", "洛贝尔", "雷利奥", "萨肯", "鲁斯蒂克斯"], ["乔治娅", "桑德拉", "伊冯"]],
	[TrainerType.STRIKER]: ["马可", "罗伯托", "托尼"],
	[TrainerType.STUDENT]: [["艾伦", "比利", "查德", "丹尼", "达德利", "杰克", "乔", "约翰尼", "基普", "内特", "瑞奇", "汤米", "杰瑞", "保罗", "泰德", "钱斯", "埃斯特班", "福雷斯特", "哈里森", "康纳", "谢尔曼", "托林", "特拉维斯", "艾尔", "卡特", "埃德加", "杰姆", "萨米", "肖恩", "谢恩", "艾尔文", "凯斯顿", "尼尔", "西摩", "威廉", "卡森", "克拉克", "诺兰"], ["乔治娅", "凯伦", "美子", "克里斯汀", "麦肯齐", "蒂耶拉", "安", "吉娜", "莉迪亚", "玛莎", "米莉", "莎莉", "塞丽娜", "西尔维娅", "艾伯塔", "卡西", "玛拉", "丽塔", "乔吉", "米娜", "妮采尔"]],
	[TrainerType.SWIMMER]: [["伯克", "卡梅伦", "查理", "乔治", "哈罗德", "杰罗姆", "柯克", "马修", "帕克", "兰德尔", "塞斯", "西蒙", "塔克", "奥斯汀", "巴里", "查德", "科迪", "达林", "大卫", "迪安", "道格拉斯", "富兰克林", "吉尔伯特", "赫尔曼", "杰克", "路易斯", "马修", "里德", "理查德", "罗德尼", "罗兰", "斯宾塞", "斯坦", "托尼", "克拉伦斯", "德克兰", "多米尼克", "哈里森", "凯文", "莱昂纳多", "诺伦", "皮特", "圣地亚哥", "阿克塞尔", "布雷登", "芬恩", "加勒特", "米莫", "里斯", "萨米尔", "托比", "艾德里安", "科尔顿", "狄龙", "埃里克", "埃文", "弗朗西斯科", "格伦", "库尔特", "奥斯卡", "里卡多", "萨姆", "谢尔廷", "特洛伊", "文森特", "韦德", "韦斯利", "杜安", "埃尔莫", "埃斯特班", "弗兰基", "罗纳德", "泰森", "巴特", "马特", "蒂姆", "赖特", "杰弗里", "凯尔", "亚历山德罗", "埃斯特班", "基兰", "拉美西斯", "凯西", "达科他", "贾里德", "卡拉尼", "基奥尼", "劳伦斯", "洛根", "罗伯特", "罗迪", "亚苏", "德里克", "雅各布", "布鲁斯", "克莱顿"], ["布里安娜", "唐", "丹尼斯", "戴安娜", "伊莱恩", "卡拉", "凯莉", "洛瑞", "妮可", "妮基", "宝拉", "苏西", "温迪", "爱丽丝", "贝丝", "贝弗利", "布伦达", "达娜", "黛布拉", "格蕾丝", "珍妮", "凯蒂", "劳雷尔", "琳达", "米西", "莎伦", "坦尼娅", "塔拉", "蒂莎", "卡莉", "伊玛尼", "伊莎贝尔", "凯拉", "西耶娜", "阿比盖尔", "阿玛拉", "安雅", "康妮", "玛丽亚", "梅丽莎", "诺拉", "雪莉", "莎妮娅", "蒂芙尼", "奥布里", "卡桑德拉", "克莱尔", "克里斯托", "埃里卡", "加布里埃尔", "海莉", "杰西卡", "乔安娜", "莉迪亚", "马洛里", "玛丽", "米兰达", "佩奇", "索菲亚", "凡妮莎", "切兰", "黛比", "乔伊", "肯德拉", "莱昂娜", "米娜", "卡罗琳", "乔伊斯", "拉丽莎", "丽贝卡", "泰拉", "达拉", "德西蕾", "薰", "露丝", "科럴", "吉纳维芙", "伊斯拉", "玛丽莎", "罗米", "谢丽尔", "亚历山德拉", "艾丽西亚", "切尔西", "杰德", "凯尔西", "劳拉", "波西亚", "谢尔比", "莎拉", "蒂亚雷", "凯拉", "娜塔莎", "莱拉", "斯嘉丽", "科拉"]],
	[TrainerType.TWINS]: ["艾米和梅", "乔和佐伊", "梅格和佩格", "安和安妮", "莉亚和皮娅", "艾米和莉芙", "吉娜和米娅", "美羽和优纪", "托莉和蒂亚", "艾丽和安妮", "珍和琪拉", "乔伊和梅格", "基里和简", "美羽和米娅", "艾玛和莉尔", "莉芙和莉兹", "泰瑞和蒂亚", "艾米和咪咪", "克莉娅和吉尔", "黛和丹妮", "凯和蒂亚", "托莉和蒂尔", "莎雅和彩", "艾米和琳", "久美和艾米", "玛尤和梅", "艾丽和艾米", "莉亚和莉莉", "瑞和乌拉", "索拉和安娜", "塔拉和瓦尔", "菲丝和乔伊", "娜娜和妮娜"],
	[TrainerType.VETERAN]: [["阿曼多", "布兰登", "布莱恩", "克莱顿", "埃德加", "伊曼纽尔", "格兰特", "哈兰", "特雷尔", "阿伦", "切斯特", "雨果", "马特尔", "雷", "肖恩", "亚伯拉罕", "卡特", "克劳德", "杰瑞", "卢修斯", "墨菲", "雷恩", "罗恩", "辛南", "斯特林", "文森特", "扎克", "杰拉德", "吉尔斯", "路易斯", "蒂莫", "明", "唐", "埃里克", "哈利", "莱昂", "罗杰", "安格斯", "阿里斯托", "布罗内", "约翰尼"], ["茱莉娅", "卡拉", "金", "小百合", "蒂芙尼", "凯茜", "塞西尔", "克洛里斯", "德娜", "吉娜", "玛雅", "奥莉安娜", "波西亚", "罗娜", "罗莎琳", "卡特里娜", "英加", "特丽莎", "希瑟", "琳恩", "谢丽", "阿隆萨", "艾拉", "莱蒂西亚", "琪娅拉"]],
	[TrainerType.WAITER]: [["伯特", "克林特", "麦克斯韦尔", "卢"], ["凯蒂", "奥罗拉", "博妮塔", "弗洛", "蒂亚", "简", "奥尔温", "佩吉特", "宝拉", "塔莉娅"]],
	[TrainerType.WORKER]: [["布雷登", "布兰登", "科林", "康拉德", "迪伦", "加里", "杰拉多", "霍顿", "杰克逊", "梅森", "昆汀", "威利", "诺埃尔", "阿诺德", "布雷迪", "布兰德", "凯恩", "克里夫", "唐", "埃迪", "菲利克斯", "菲利普", "格伦", "格斯", "希斯", "马修", "巴顿", "里奇", "罗布", "瑞安", "斯科特", "谢尔比", "斯特林", "泰勒", "维克多", "扎克", "弗里德里希", "赫尔曼", "艾萨克", "利奥", "梅纳德", "米切尔", "摩根", "内森", "尼尔", "帕斯夸尔", "保罗", "塔瓦里斯", "蒂博尔", "迪米特里", "纳雷克", "优素福", "弗兰克", "杰夫", "瓦茨拉夫", "奥维德", "弗朗西斯", "基思", "罗素", "桑根", "托威", "轰炸机", "齐安", "德米特", "胡博尔", "科比尔", "拉博", "奥多", "雷泰", "罗尼克斯", "韦格尔", "多比特", "卡斯特", "洛贝尔", "雷利奥", "萨肯", "鲁斯蒂克斯"], ["乔治娅", "桑德拉", "伊冯"]],
	[TrainerType.YOUNGSTER]: [["艾伯特", "戈登", "伊恩", "杰森", "吉米", "米奇", "欧文", "塞缪尔", "沃伦", "艾伦", "本", "比利", "卡尔文", "迪伦", "埃迪", "乔伊", "乔什", "尼尔", "蒂米", "汤米", "布雷登", "迪安德烈", "德米特里厄斯", "狄龙", "杰伦", "约翰逊", "重信", "查德", "科尔", "科德尔", "丹", "戴夫", "德斯汀", "纳什", "泰勒", "亚苏", "奥斯汀", "达拉斯", "达里乌斯", "唐尼", "乔纳森", "洛根", "迈克尔", "奥利弗", "塞巴斯蒂安", "特里斯坦", "韦恩", "诺曼", "罗兰", "里吉斯", "安倍", "阿斯特", "凯塔", "肯尼斯", "凯文", "凯尔", "莱斯特", "正男", "尼古拉斯", "帕克", "韦斯", "扎卡里", "科迪", "亨利", "杰伊", "卡尔", "肯尼", "正弘", "佩德罗", "皮蒂", "辛克莱", "特雷尔", "韦伦", "艾丹", "安东尼", "大卫", "雅各布", "杰登", "卡特勒", "哈姆", "迦勒", "凯", "霍纳斯", "肯威", "布雷特", "克里斯", "席德", "丹尼斯", "伊斯顿", "肯", "罗比", "罗尼", "肖恩", "本杰明", "杰克", "特拉维斯", "亚当", "阿迪", "贝尔特兰", "埃利安", "赫尔南", "朱利安", "卢卡", "罗伊", "伯尼", "达斯汀", "乔纳森", "怀亚特"], ["爱丽丝", "布丽奇特", "嘉莉", "康妮", "达娜", "艾伦", "克里斯", "劳拉", "琳达", "米歇尔", "香农", "安德莉亚", "克丽丝", "珍妮丝", "罗宾", "莎莉", "蒂安娜", "海莉", "艾丽", "安", "达莉娅", "唐", "艾丽丝", "乔安娜", "茱莉娅", "凯", "丽莎", "梅根", "米凯拉", "米里亚姆", "佩奇", "瑞丽", "布莱斯", "布里安娜", "卡罗琳", "卡西迪", "凯特琳", "玛德琳", "莫莉", "娜塔莉", "萨曼莎", "莎拉", "凯茜", "黛伊", "艾丽", "伊娃", "菲伊", "卡拉", "勒琳", "真希", "玛丽", "玛雅", "米基", "西比尔", "达雅", "戴安娜", "弗洛", "赫莉娅", "亨丽埃塔", "伊莎贝尔", "梅", "珀尔塞福涅", "塞丽娜", "安娜", "夏洛特", "艾琳", "艾尔莎", "莉斯", "莎拉", "苏泽特", "奥黛丽", "艾米", "伊莎贝拉", "麦迪逊", "里卡", "莱莉", "莎拉", "艾莉", "亚历山德拉", "艾米", "拉斯", "布列塔尼", "切尔", "辛迪", "黛安", "艾米丽", "艾玛", "伊芙琳", "哈娜", "哈琳", "黑兹尔", "乔斯林", "卡特里娜", "金伯利", "莉娜", "玛吉", "米拉", "瑞uki", "丽娜", "萨尔", "佐藤", "夏天", "知惠", "维姬", "岳", "由美", "劳伦", "蕾", "莱利", "露易丝", "南希", "塔米", "特里"]],
	[TrainerType.HEX_MANIAC]: ["金德拉", "帕特里夏", "塔米", "塔莎", "瓦莱丽", "阿莱娜", "凯瑟琳", "利亚", "玛吉", "西尔维娅", "安妮娜", "阿拉克娜", "嘉莉", "苔丝狄蒙娜", "乔塞特", "露娜", "梅兰妮", "奥桑娜", "拉齐娅"],
};

function fetchAndPopulateTrainerNames(url: string, parser: DOMParser, trainerNames: Set<string>, femaleTrainerNames: Set<string>, forceFemale: boolean = false) {
  return new Promise<void>(resolve => {
    fetch(`https://bulbapedia.bulbagarden.net/wiki/${url}_(Trainer_class)`)
      .then(response => response.text())
      .then(html => {
        console.log(url);
        const htmlDoc = parser.parseFromString(html, 'text/html');
        const trainerListHeader = htmlDoc.querySelector('#Trainer_list').parentElement;
        const elements = [...trainerListHeader.parentElement.childNodes];
        const startChildIndex = elements.indexOf(trainerListHeader);
        const endChildIndex = elements.findIndex(h => h.nodeName === 'H2' && elements.indexOf(h) > startChildIndex);
        const tables = elements.filter(t => {
          if (t.nodeName !== 'TABLE' || t['className'] !== 'expandable')
            return false;
          const childIndex = elements.indexOf(t);
          return childIndex > startChildIndex && childIndex < endChildIndex;
        }).map(t => t as Element);
        console.log(url, tables)
        for (let table of tables) {
          const trainerRows = [...table.querySelectorAll('tr:not(:first-child)')].filter(r => r.children.length === 9);
          for (let row of trainerRows) {
            const nameCell = row.firstElementChild;
            const content = nameCell.innerHTML;
            if (content.indexOf(' <a ') > -1) {
              const female = /♀/.test(content);
              if (url === 'Twins')
              console.log(content)
              const nameMatch = />([a-z]+(?: &amp; [a-z]+)?)<\/a>/i.exec(content);
              if (nameMatch)
                (female || forceFemale ? femaleTrainerNames : trainerNames).add(nameMatch[1].replace('&amp;', '&'));
            }
          }
        }
        resolve();
      });
    });
}

/*export function scrapeTrainerNames() {
  const parser = new DOMParser();
  const trainerTypeNames = {};
  const populateTrainerNamePromises: Promise<void>[] = [];
  for (let t of Object.keys(trainerNameConfigs)) {
    populateTrainerNamePromises.push(new Promise<void>(resolve => {
      const trainerType = t;
      trainerTypeNames[trainerType] = [];
      
      const config = trainerNameConfigs[t] as TrainerNameConfig;
      const trainerNames = new Set<string>();
      const femaleTrainerNames = new Set<string>();
      console.log(config.urls, config.femaleUrls)
      const trainerClassRequests = config.urls.map(u => fetchAndPopulateTrainerNames(u, parser, trainerNames, femaleTrainerNames));
      if (config.femaleUrls)
        trainerClassRequests.push(...config.femaleUrls.map(u => fetchAndPopulateTrainerNames(u, parser, null, femaleTrainerNames, true)));
      Promise.all(trainerClassRequests).then(() => {
        console.log(trainerNames, femaleTrainerNames)
        trainerTypeNames[trainerType] = !femaleTrainerNames.size ? Array.from(trainerNames) : [ Array.from(trainerNames), Array.from(femaleTrainerNames) ];
        resolve();
      });
    }));
  }
  Promise.all(populateTrainerNamePromises).then(() => {
    let output = 'export const trainerNamePools = {';
    Object.keys(trainerTypeNames).forEach(t => {
      output += `\n\t[TrainerType.${TrainerType[t]}]: ${JSON.stringify(trainerTypeNames[t])},`;
    });
    output += `\n};`;
    console.log(output);
  });
}*/